cr1901/msp430g2xx/svds/msp430g2x55.svd
        <register>
          <name>P1SEL2</name>
          <description>Port 1 Selection 2</description>
          <addressOffset>33</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1SEL2</name>
              <description>Port 1 Selection register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>P2SEL2</name>
          <description>Port 2 Selection 2</description>
          <addressOffset>34</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <writeConstraint>
            <range>
              <minimum>0</minimum>
              <maximum>255</maximum>
            </range>
          </writeConstraint>
          <fields>
            <field>
              <name>P0</name>
              <description>P0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P1</name>
              <description>P1</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2</name>
              <description>P2</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P3</name>
              <description>P3</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P4</name>
              <description>P4</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P5</name>
              <description>P5</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P6</name>
              <description>P6</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P7</name>
              <description>P7</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>P2SEL2</name>
              <description>Port 2 Selection register 2</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>ADC10</name>
      <description>ADC10</description>
      <baseAddress>72</baseAddress>
      <registers>
        <register>
          <name>ADC10DTC0</name>
          <description>ADC10 Data Transfer Control 0</description>
          <addressOffset>0</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>ADC10FETCH</name>
              <description>This bit should normally be reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10B1</name>
              <description>ADC10 block one</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10CT</name>
              <description>ADC10 continuous transfer</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10TB</name>
              <description>ADC10 two-block mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10DTC1</name>
          <description>ADC10 Data Transfer Control 1</description>
          <addressOffset>1</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>ADC10DTC1</name>
              <description>ADC10 Data Transfer Control 1 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10AE0</name>
          <description>ADC10 Analog Enable 0</description>
          <addressOffset>2</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
          <fields>
            <field>
              <name>ADC10AE0</name>
              <description>ADC10 Analog Enable 0 register</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>255</maximum>
                </range>
              </writeConstraint>
            </field>
          </fields>
        </register>
        <register>
          <name>ADC10AE1</name>
          <description>ADC10 Analog Enable 1</description>
          <addressOffset>3</addressOffset>
          <size>8</size>
          <resetMask>255</resetMask>
        </register>
        <register>
          <name>ADC10CTL0</name>
          <description>ADC10 Control 0</description>
          <addressOffset>360</addressOffset>
          <size>16</size>
          <resetMask>65535</resetMask>
          <fields>
            <field>
              <name>ADC10SC</name>
              <description>ADC10 Start Conversion</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ENC</name>
              <description>ADC10 Enable Conversion</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10IFG</name>
              <description>ADC10 Interrupt Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10IE</name>
              <description>ADC10 Interrupt Enalbe</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10ON</name>
              <description>ADC10 On/Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFON</name>
              <description>ADC10 Reference on</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REF2_5V</name>
              <description>ADC10 Ref 0:1.5V / 1:2.5V</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MSC</name>
              <description>ADC10 Multiple SampleConversion</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFBURST</name>
              <description>ADC10 Reference Burst Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REFOUT</name>
              <description>ADC10 Enalbe output of Ref.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10SR</name>
              <description>ADC10 Sampling Rate 0:200ksps / 1:50ksps</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ADC10SHT</name>
              <description>ADC10 Sample Hold Select Bit: 0</description>
              <bitOffset>11</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC10SHT_0</name>
                  <description>4 x ADC10CLKs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_1</name>
                  <description>8 x ADC10CLKs</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_2</name>
                  <description>16 x ADC10CLKs</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC10SHT_3</name>
                  <description>64 x ADC10CLKs</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SREF</name>
              <description>ADC10 Reference Select Bit: 0</description>
              <bitOffset>13</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SREF_0</name>
                  <description>VR+ = AVCC and VR- = AVSS</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_1</name>
                  <description>VR+ = VREF+ and VR- = AVSS</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_2</name>
                  <description>VR+ = VEREF+ and VR- = AVSS</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_3</name>
                  <description>VR+ = VEREF+ and VR- = AVSS</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_4</name>
                  <description>VR+ = AVCC and VR- = VREF-/VEREF-</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_5</name>
                  <description>VR+ = VREF+ and VR- = VREF-/VEREF-</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_6</name>
                  <description>VR+ = VEREF+ and VR- = VREF-/VEREF-</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SREF_7</name>
                  <description>VR+ = VEREF+ and VR- = VREF-/VEREF-</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
